load-tests/report/statistics.json
{
  "GET /answer" : {
    "transaction" : "GET /answer",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.5,
    "medianResTime" : 8.5,
    "minResTime" : 6.0,
    "maxResTime" : 50.0,
    "pct1ResTime" : 46.000000000000014,
    "pct2ResTime" : 50.0,
    "pct3ResTime" : 50.0,
    "throughput" : 0.4365668383829564,
    "receivedKBytesPerSec" : 2.1516264843272506,
    "sentKBytesPerSec" : 0.08722810071596962
  },
  "GET /stats" : {
    "transaction" : "GET /stats",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.7,
    "medianResTime" : 4.5,
    "minResTime" : 3.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 6.9,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 0.45203869451225026,
    "receivedKBytesPerSec" : 0.11345111766567219,
    "sentKBytesPerSec" : 0.05341472855076394
  },
  "POST /parse" : {
    "transaction" : "POST /parse",
    "sampleCount" : 10,
    "errorCount" : 4,
    "errorPct" : 40.0,
    "meanResTime" : 2505.2000000000003,
    "medianResTime" : 757.0,
    "minResTime" : 4.0,
    "maxResTime" : 13158.0,
    "pct1ResTime" : 12643.000000000002,
    "pct2ResTime" : 13158.0,
    "pct3ResTime" : 13158.0,
    "throughput" : 0.45250916331055707,
    "receivedKBytesPerSec" : 0.4124727080410878,
    "sentKBytesPerSec" : 0.11065263134078465
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 30,
    "errorCount" : 4,
    "errorPct" : 13.333333,
    "meanResTime" : 840.8,
    "medianResTime" : 7.0,
    "minResTime" : 3.0,
    "maxResTime" : 13158.0,
    "pct1ResTime" : 1321.3000000000009,
    "pct2ResTime" : 10325.499999999996,
    "pct3ResTime" : 13158.0,
    "throughput" : 1.2032729022942403,
    "receivedKBytesPerSec" : 2.4430513496711055,
    "sentKBytesPerSec" : 0.22561366918017006
  }
}